/*
 * Copyright (C) 2009-2010 Amit Kucheria <amit.kucheria@canonical.com>
 * Copyright (C) 2010 Freescale Semiconductor, Inc.
 *
 * The code contained herein is licensed under the GNU General Public
 * License. You may obtain a copy of the GNU General Public License
 * Version 2 or later at the following locations:
 *
 * http://www.opensource.org/licenses/gpl-license.html
 * http://www.gnu.org/copyleft/gpl.html
 *
 * 
 * Copyright (C) 2011/2012 TokenWireless Tech, Inc 
 */

#ifndef __MACH_IOMUX_MX53_TRACTOR_H__
#define __MACH_IOMUX_MX53_TRACTOR_H__

#include "iomux-tractor.h"

typedef struct
{
    unsigned GPR0;                // 0x0000
    unsigned GPR1;                // 0x0004
    unsigned GPR2;                // 0x0008
    unsigned OBSERVE[5];          // 0x000C~0x001C
    unsigned SW_MUX_CTL[202];     // 0x0020~0x0344
    unsigned SW_PAD_CTL[234];     // 0x0348~0x06EC
    unsigned SW_PAD_GRP_CTL[16];  // 0x06F0~0x072C
    unsigned SELECT_INPUT[94];    // 0x0730~0x08A4
} csp_iomux_mx53_regs;

typedef enum {
    DDK_IOMUX_PIN_GPIO_19                     = (0),
    DDK_IOMUX_PIN_KEY_COL0                    = (1),
    DDK_IOMUX_PIN_KEY_ROW0                    = (2),
    DDK_IOMUX_PIN_KEY_COL1                    = (3),
    DDK_IOMUX_PIN_KEY_ROW1                    = (4),
    DDK_IOMUX_PIN_KEY_COL2                    = (5),
    DDK_IOMUX_PIN_KEY_ROW2                    = (6),
    DDK_IOMUX_PIN_KEY_COL3                    = (7),
    DDK_IOMUX_PIN_KEY_ROW3                    = (8),
    DDK_IOMUX_PIN_KEY_COL4                    = (9),
    DDK_IOMUX_PIN_KEY_ROW4                    = (10),
    DDK_IOMUX_PIN_DI0_DISP_CLK                = (11),
    DDK_IOMUX_PIN_DI0_PIN15                   = (12),
    DDK_IOMUX_PIN_DI0_PIN2                    = (13),
    DDK_IOMUX_PIN_DI0_PIN3                    = (14),
    DDK_IOMUX_PIN_DI0_PIN4                    = (15),
    DDK_IOMUX_PIN_DISP0_DAT0                  = (16),
